[
    {
        "id":0,
        "animal_name": "Pig",
        "icon":"🐷",
        "class": "Mammal",
        "lives_on": "Land & Domestic",
        "vegeterian": true,
        "description": "The pig (Sus domesticus), often called swine, hog, or domestic pig when distinguishing from other members of the genus Sus, is an omnivorous, domesticated, even-toed, hoofed mammal. It is variously considered a subspecies of Sus scrofa (the wild boar or Eurasian boar) or a distinct species. The pig's head-plus-body length ranges from 0.9 to 1.8 m (3 to 6 ft), and adult pigs typically weigh between 50 and 350 kg (110 and 770 lb), with well-fed individuals even exceeding this range. The size and weight of hogs largely depends on their breed. Compared to other artiodactyls, a pig's head is relatively long and pointed. Most even-toed ungulates are herbivorous, but pigs are omnivores, like their wild relative. Pigs grunt and make snorting sounds."
    },
    {
        "id":1,
        "animal_name": "Giant Panda Bear",
        "icon":"🐼",
        "class": "Mammal",
        "lives_on": "Land - Forest",
        "vegeterian": false,
        "description": "The giant panda, Ailuropoda melanoleuca, is a bear. It lives in south-central China Although it belongs to the order Carnivora, the panda's diet is 99% bamboo. In captivity, they may get honey, eggs, fish, yams, shrub leaves, oranges, bananas, and specially prepared food. Pandas in the wild occasionally eat other grasses, wild tubers, or even meat in the form of birds, rodents, or carrion.The giant panda lives in a few mountain ranges in central China, mainly in Sichuan province but also in the Shaanxi and Gansu provinces. As a result of farming, deforestation and other development, the panda has been driven out of the lowland areas where it once lived."
    },
    {
        "id":2,
        "animal_name": "Koala",
        "icon":"🐨",
        "class": "Mammal",
        "lives_on": "Land - Forest",
        "vegeterian": true,
        "description": "Koala (Phascolarctos cinereus) is herbivore marsupials that live in the eucalyptus forests of eastern Australia. They are the only living species in the family Phascolarctidae. They are related to the wombats. Koalas are often called koala bears because a koala looks like a small bear or teddy bear However, it is not a bear, it is quite a different type of animal.The koala is not an endangered species but a near vulnerable species. One reason is the loss of habitat, which means that koalas have less space to live. In some places, there are very few koalas left. But there are also places, such as French Island (Victoria), with too many koalas that overeat. Because of this, the eucalyptus trees and other animals are in danger. A study looking at koala numbers at 1800 sites for 20 years shows that the number of koalas is falling. The Australian Koala Foundation study estimates that only about 50,000 koalas are left. There are over 500 types of gum trees in the world. However, koalas only eat 4-6 types that they prefer."
    },
    {
        "id":3,
        "animal_name": "Dog",
        "icon":"🐕",
        "class": "Mammal",
        "lives_on": "Land - Pets and Wild",
        "vegeterian": false,
        "description": "Dogs are domesticated mammals, not natural wild animals. They were initially bred from wolves. Dogs have been bred by humans for a long time and were the first animals ever to be domesticated. Studies suggest that this happened between 15.000 and 100.000 years before our time. The dingo is also a dog, but many dingos have become wild animals and live independently of humans in the range where they occur (parts of Australia).Today, some dogs are used as pets, and others are used to help humans do their work. They are popular pets because they are usually playful, friendly, loyal, and listen to humans. Thirty million dogs in the United States are registered as pets. Dogs eat both meat and vegetables, often mixed together and sold in stores as dog food. Dogs often have jobs, including police dogs, army dogs, assistance dogs, fire dogs, messenger dogs, hunting dogs, herding dogs, or rescue dogs."
    },
    {
        "id":4,
        "animal_name": "Cat",
        "icon":"🐈",
        "class": "Mammal",
        "lives_on": "Land - Pets and Wild",
        "vegeterian": false,
        "description": "Domestic cats are often called 'house cats' when kept as indoor pets. Cats have been domesticated (tamed) for nearly 10 000 years.They are one of the most popular pets in the world. They are kept by humans for hunting rodents and as companions.There are also farm cats, which are kept on farms to keep rodents away, and feral cats, which are domestic cats that live away from humans. A cat is sometimes called a kitty. A young cat is called a kitten. A female cat with no sex organs removed is called a queen. A male cat that has not had its sex organs removed is called a tom.There are about 60 breeds of cats. Domestic cats are found in shorthair, longhair, and hairless breeds. "
    },
    {
        "id":5,
        "animal_name": "Spider",
        "icon":"🕷️",
        "class": "Land - Every continent except for Antarctica!!",
        "lives_on": 8,
        "vegeterian": false,
        "description": "Spiders are air-breathing arthropods. They have eight legs, mouthparts (chelicerae), and fangs that inject venom. Most make silk. The Spiders are seventh in the number of species of all animal orders. About 48,000 spider species and 120 families have been recorded by taxonomists. Over twenty different classifications have been proposed since 1900.p3 Spiders live on every continent except for Antarctica and in nearly every habitat, except air and sea.Almost all spiders are predators and primarily eat insects. They catch their prey in several ways. Some build a spider web, and some use a thread of silk that they throw at the insect. Others will make web 'nets' to throw at passing insects. Some kinds of spiders hide in holes in the ground, then run out and grab an insect that walks by. Or they go out and simply attack their prey. Some can jump quite well and hunt by sneaking close to an insect and then jumping on it."
    },
    {
        "id":6,
        "animal_name": "Turtle",
        "icon":"🐢",
        "class": "Reptile",
        "lives_on": "Sea & Land",
        "vegeterian": true,
        "description": "Turtles are a type of reptile with hard shells on their back. There are two types of turtles, the side-necked turtles,and the hidden neck turtles. Side-necked turtles have very easy-to-see necks, but hidden-neck turtles have tiny channels. The order Testudines (which includes turtles) includes both living and extinct species. The earliest turtle fossil was found in China in the early Upper Triassic age. The fossil was from about 220 million years ago. Turtles are one of the oldest reptile groups that are not extinct Turtles have been on earth longer than lizards, snakes, and crocodiles. Turtles are definitely related to dinosaurs. Turtles come from ancient turtles, which had spiked shells.Turtles are almost everywhere in the world. A lot of the turtle species alive today are endangered."
    },
    {
        "id":7,
        "animal_name": "Sharks",
        "icon":"🦈",
        "class": "Chondrichthyes or cartilaginous fishes",
        "lives_on": "Sea",
        "vegeterian": false,
        "description": "Sharks are also known by their scientific name Selachimorpha. They have skeletons made of cartilage instead of bone Cartilage is tough, rubbery material which is less rigid than bone. Cartilaginous fish also includes skates and rays. There are more than 350 kinds of sharks, such as the great white and whale sharks. Fossils show sharks have been around for 420 million years since the early Silurian. Most sharks are predators: they hunt and eat fish, marine mammals, and other sea creatures. However, the most giant shark eats krill, like whales. This is the whale shark, the largest fish in the world. It is widely believed that sharks are \"silent killers.\"However, a recent study shows that sharks emit a low growl from their throats which resonates through their scales.Some common kinds of sharks are the hammerhead, the great white, the tiger, and the mako. Most sharks are cold-blooded, but some, like the great white shark and the mako shark, are partially warm-blooded. A giant shark called Megalodon swam in the seas just a few million years ago. It was 18 meters long, twice as long as the closely-related great white shark, and it ate whales. Megalodon died out 1.6 million years ago. Much of what we understand about prehistoric sharks comes from studying their fossils. While sharks have skeletons made of soft cartilage that can fall apart before fossilizing, their teeth are more problematic and easily fossilized. Prehistoric sharks, like their modern descendants, would grow and shed thousands of teeth over their lifetime. For this reason, shark teeth are one of the most common fossils."
    },
    {
        "id":8,
        "animal_name": "Dolphin",
        "icon":"🐬",
        "class": "Mammal",
        "lives_on": "Sea",
        "vegeterian": true,
        "description": "Dolphins are part of the toothed whales. Generally, they are among the smaller whales. Most live in saltwater oceans, but some live in rivers – there are oceanic dolphins and river dolphins. Dolphins are from 1.5 meters (4.9 ft) to 4 meters (13 ft) long, but the largest dolphin, the killer whale (or orca), can be up to 8 meters (26 ft) long. All dolphins live in groups called \"pods.\" They are social animals at all stages of their life. They have some unusual behaviors. A speeding group of dolphins is a sight to see. They \"porpoise\" in and out of the water at high speed. The function of this is not known for sure. It may be the fastest movement they are capable of. What they eat, almost exclusively, is fish. When they chase fish, they go into a \"bait ball\" to self-protect. In turn, the dolphins attack in a group and eat as many fish as possible.The name 'dolphin' comes from the Ancient Greek δελφίς (delphis), meaning \"with a womb,\" because it was first thought to be a fish with a womb. It is now known to be a mammal and quite an intelligent mammal. Dolphins breathe air. A dolphin's nose is on top of its head, so the dolphin can easily breathe on the water's surface. The skin of a dolphin has no scales. It is soft and smooth. However, it is substantial due to how much muscle they have. Dolphins use echolocation to find their food.The skin of a bottlenose dolphin is gray, smooth, and rubbery. Dolphins are always social. They can help each other fight off predators. They can kill large sharks by ramming them repeatedly with their snouts and heads. They look after the young when the mothers need to leave their calves to hunt for food. The young need to breathe more often than the adults, and the food may be in deeper waters. Oceanic dolphins are marine animals living in the sea. They live in all of the oceans."
    }
]
